# -*- coding: utf-8 -*-
"""
# Математичні функції
Стандартний модуль math містить математичні функції і константи. Наприклад, якщо модуль імпортується так: `import math`, то функції потрібно викликати так: `math.sin(x)`.
"""
from math import * # імпортувати усе з модуля math
x,y=1,1
acos(x) # арккосинус x
asin(x) # арксинус x
atan(x) # арктангенс x
atan2(y,x) # atan(y/x)
ceil(x) # найменше ціле, більше або рівне x
cos(x) # косинус x
cosh(x) # гіперболічний косинус x
e # константа e
exp(x) # експонента (e**x)
fabs(x) # абсолютне значення x
floor(x) # найбільше ціле, менше або рівне x
fmod(x,y) # остача від ділення x на y
frexp(x) # мантиса і порядок x як пара (m, i), де m - число з плаваючою комою, а i - ціле, таке, що x = m * 2.**i. Якщо x=0, то повертає (0,0), інакше 0.5 <= abs(m) < 1.0
hypot(x,y) # sqrt(x*x + y*y)
ldexp(x,y) # x * (2**y)
log(x) # натуральний логарифм x
log10(x) # десятковий логарифм x
modf(x) # пара (y,q) - ціла та дробова частина x. Обидві частини мають знак x
pi # константа пі
pow(x,y) # x в степені y (або x**y)
sin(x) # синус x
sinh(x) # гіперболічний синус x
sqrt(x) # корінь квадратний від x
tan(x) # тангенс x
tanh(x) # гіперболічний тангенс x
