# -*- coding: utf-8 -*-
"""
# anydbm - універсальний доступ до DBM баз даних
Модуль anydbm реалізує універсальний доступ до різних DBM баз даних (БД). Для доступу до бази даних використовується подібний на словник інтерфейс. На відміну від shelve, ключі і значення словника повинні бути рядками.
"""
import anydbm
db=anydbm.open("mydbm.db", "c") # відкрити БД для читання і запису, створити, якщо не існує
db["Іванов"]="1990" # записати у БД (зверніть увагу - рядки!)
db["Петров"]="1992"
for k,v in db.iteritems(): # вивести усі записи бази даних
    print k,v # ключ і значення
db.close() # закрити БД
