# -*- coding: utf-8 -*-
"""
# Генератори
Генератор створюється функцією, яка використовує інструкцію `yield`. Застосовуються для генерування послідовностей. Виклик метода `next` генератора виконує цю функцію, поки не досягнуто наступної інструкції `yield`, повертає значення після інструкції `yield` і зупиняє виконання функції. Наступний виклик метода `next` продовжує виконання функції з наступної за `yield` інструкції.
"""
def generator(n): # функція генератора (генерує послідовність)
    while n<3:
        yield n # генерувати значення n
        n+=1
genObj=generator(0) # створити об'єкт генератора, який має можливість ітерації (є ітератором)
print genObj.next(), genObj.next(), genObj.next() # 0 1 2
#print genObj.next() # помилка: StopIteration 
for x in generator(0): # або так
    print x, # виведе: 0 1 2
print
def generator2(n): # функція генератора з кількома інструкціями yield
    while n<3:
        yield n # генерувати значення n
        yield n # генерувати значення n
        n+=1
for x in generator2(0):
    print x, # виведе: 0 0 1 1 2 2
