# -*- coding: utf-8 -*-
"""
# shelve - збереження об'єктів Python
Модуль shelve (полиця) призначений для збереження у постійній пам'яті Python-об'єктів (які може зберігати pickle) в об'єкті, подібному на словник.
"""
import shelve
d=shelve.open("file.dat") # відкрити файл полиці
d["1"]=[1,2,3] # записати у полицю об'єкт під ключем "1"
d["2"]=[4,5,6]
d.close() # закрити файл полиці

d = shelve.open("file.dat")
if d.has_key("2"): # якщо є ключ "2"
    del d["2"] # видалити об'єкт під ключем "2"
d.sync() # зберегти усі зміни на диску
print d.keys() # вивести список усіх ключів
if d.has_key("1"): print d["1"] # об'єкт під ключем "1"
d.close()
