# -*- coding: utf-8 -*-
"""
# Класи
Об’єктно-орієнтоване програмування (ООП) основане на використанні об’єктів, які є абстрактними моделями реальних об’єктів. Об’єкти створюються за допомогою спеціальних типів даних - класів. Кожен клас описує множину об’єктів певного типу. Основними принципами ООП є інкапсуляція, успадкування і поліморфізм. Інкапсуляція - об’єднання даних (атрибутів) і функцій їх опрацювання (методів) в класі. Наприклад, в класі `A` об’єднано атрибут `a` і метод `f`. Ідентифікатор `self` використовується в класах як посилання на об'єкт цього класу. Методи об'єктів повинні мати перший аргумент `self`.
"""
class A: # визначення класу A
    a=5 # атрибут-дане a
    def f(self): # атрибут-метод f
        return self.a**2 # повертає квадрат a
obj=A() # створення об'єкта (екземпляра) obj класу A
obj.a=2 # зміна атрибута-даного a
print obj.f() # виклик методу f
