# -*- coding: utf-8 -*-
"""
# Послідовність кортеж. Оператори для усіх послідовностей
Кортеж - це об'єкт-контейнер типу `tuple`, який містить незмінну послідовність елементів довільного типу. Нижче показані спільні для усіх послідовностей (tuple, list, str, unicode) оператори.
"""
a = (1,2,3,4,5) # кортеж
b = "a",5,3.07 # кортеж з різнотипними елементами
x,y=3,5 # використання кортежу в операторі присвоювання
print a,len(a),b,len(b) # вивести кортежі і їх довжини
# вивести елементи [індекс першого:індекс останнього:крок]
print a[0],a[-1],a[1:4:2],a[::2]
print min(b),max(b) # мінімальне і максимальне
print a+b # об'єднання
print 2*a # об'єднані 2 копії
print "a" in b # чи "a" належить b
for x in a: # для кожного x у a
    print x, # вивести x
