# -*- coding: utf-8 -*-
"""
# scipy.vectorize - векторизація функцій
Функція `scipy.vectorize` визначає векторизовану функцію, яка отримує  послідовність або масив numpy і повертає один або кортеж масивів numpy. Використовується для перетворення звичайних функцій в їх векторизований варіант. 
"""
from scipy import vectorize
def f(x): return x+2 # звичайна функція    
#print f([1,2,3]) # буде помилка!
fv=vectorize(f) # векторизована функція (приймає та повертає вектори)
print fv([1,2,3]) # повертає масив ndarray
