# -*- coding: utf-8 -*-
"""
# Менеджери контексту і інструкція with
Менеджер контексту - це об'єкт, який визначає контекст (середовище) виконання інструкцій всередині блоку `with`. Містить методи `__enter__` та `__exit__`, які автоматично викликаються на початку і вкінці блоку `with`. Часто використовується під час роботи з файлами. Приклад показує створення і використання класу менеджера контексту.
"""
with open(__file__,'r') as f: # закриє файл автоматично
    print f.read(1)

class A(object): # клас реалізує власний спосіб керування контекстом
    def __init__(self,a):
        self.a=a
    def __enter__(self): # викликається під час входу в `with`
        print 'with enter'
        return self # obj=self
    def __exit__(self,type,value,tb): # викликається під час виходу з `with`
        print 'with exit'
        return False
with A(1) as obj: # тут викликається __enter__
    print obj.a
# тут викликається __exit__
