# -*- coding: utf-8 -*-
"""
# Множина
Множина - це об'єкт-контейнер типу `set`, який містить невпорядковану сукупність елементів, які не повторюються.
"""
s1={1,1,2,3,2,5,3,1,5} # множина
s2=set([7,7,8,9,1,2]) # множина зі списку
s3=set("hello") # множина з рядка
print s1,len(s1),s2,len(s2) # вивести множини і їх довжини
print 2 not in s1 # чи 2 не в множині s1?
for x in s1: pass # для кожного в множині виконати пусту команду
s1.add(7) # додати елемент
s1.remove(7) # видалити елемент
s1.discard(7) # видалити елемент, якщо він є
print s1.pop() # вивести довільний і видалити його
print s1.issubset(s2) # чи кожен у s1 є у s2 (s1 <= s2)
print s1.issuperset(s2) # чи кожен у s2 є у s1 (s1 >= s2)
print s1.union(s2) # об'єднання (s1 | s2)
print s1.intersection(s2) # перетин (s1 & s2)
print s1.difference(s2) # різниця (s1 - s2)
print s1.symmetric_difference(s2) # симетрична різниця (s1 ^ s2)
