# -*- coding: utf-8 -*-
"""
# Послідовність список
Список - це об'єкт-контейнер типу `list`, який містить послідовність елементів довільного типу. Ця послідовність може змінюватися.
"""
a = [1,2,3,4,5] # список
b=[1.0/x for x in range(1,4) if x!=2] # генератор списку
c=list("string") # список з рядка
d=range(5) # список з прогресії
e=[1,"abc",2.3,(1+1j),a] # список з різнотипними елементами
print a,len(a),b,len(b) # вивести списки і їх довжини
print e[4] # вивести елемент з індексом 4 (список a)
print a[0],a[-1],a[1:4:2],a[::2] # вивести елементи [індекс першого:індекс останнього:крок]
print min(a),max(a) # мінімальне і максимальне
print a+[6,7] # об'єднання
print 2*a # об'єднані 2 копії
print 3 in a # чи 3 належить a
a[0]=2 # присвоїти значення елементу з індексом 0
a[::2]=[0,0,0] # непарним елементам присвоїти 0
del a[4] # видалити елемент з індексом 4
a.append(5) # додати в кінець 5
a.extend([6,7]) # розширити список
print a.count(0) # кількість елементів рівних 0
print a.index(5) # мінімальний індекс елемента зі значенням 5
a.insert(1,9) # вставити в позицію 1
print a.pop(1) # вивести елемент з індексом 1 і видалити
a.reverse() # обернути список
a.sort() # сортувати за зростанням
for x in a[:]: # для кожного x у копії a
    print x, # вивести x
