# -*- coding: utf-8 -*-
"""
# Модулі
Модулем є будь-який файл з вихідним кодом Python. Команда `import`
імпортує модуль в програму, тобто код модуля виконується в окремому просторі імен і створюється об'єкт модуля, який містить об'єкти з цього простору імен. Команда `from` працює аналогічно, але імпортує тільки визначені імена. Пакети містять кілька модулів. Щоб створити пакет, створіть папку з його іменем і розмістіть в ній файл `__init__.py`. Він виконується під час імпорту пакета. Для прикладу створіть нову папку проекту `c:\1`. В ній створіть файли `main.py`, `module1.py` та папку `package1`. В папці `package1` створіть файли `__init__.py`, `module1.py`, `module2.py`. Виконайте модуль `main.py`.

## Файл `c:\1\main.py`:
"""
import sys # імпортує модуль (і тільки 1 раз)
import module1 as m # імпортувати модуль і змінити його ім'я на m
from package1 import * # імпортувати з пакету все
#або
#from package1.module1 import * # імпортувати з модуля все
#from package1.module2 import * # імпортувати з модуля все
if __name__ == '__main__':# якщо модуль виконується, а не імпортується
    print __name__, __file__ # ім'я і файл модуля 
    #print sys.path # шляхи пошуку модулів
    sys.path.append("c:\SomeFolder") # додати шлях пошуку модулів
    print m.__doc__ # рядок документації модуля
    print m.__dict__.keys() # список імен
    m.a='a_'
    m.f() # виведе 'a_'
    print a,b,c
    reload(m) # повторно завантажити модуль
    print m.a # виведе 'a'
