# -*- coding: utf-8 -*-
"""
# Послідовність рядок
Рядок - це об'єкт-контейнер типу `str`, який містить незмінну послідовність символів. Для створення літерала рядка його потрібно взяти в апострофи, лапки або потрійні апострофи чи лапки. Кодування символів літерала рядка відповідає кодуванню символів файлу програми (тут це UTF-8). Кодування символів (ASCII, UTF-8, CP1251, CP866 та ін.) - це таблиця, у якій кожен символ кодується одним або більшою кількістю байтів.
"""
s1="Рядок1" # рядок
s2='"String"2\n' # рядок з спецсимволом переводу рядка
s3='''Str
ing3''' # рядок з переводом рядка
s4=r"String\t4\n" # необроблюваний рядок
s5=u"String5" # Unicode рядок
s6=ur"String6\n" # Unicode необроблюваний рядок
print s1,s2,s3,s4,s5,s6,len(s6) # вивести рядки і довжину рядка s6
print s1+" "*5+str(3.14)+" "+repr(3.14) # об'єднання рядків
print s1[2],s1[:2],s1[2:],s1[-2] # зрізи рядка
print "я" in s1 # чи "я" належить s1
for x in s1: pass # для кожного символу x у s1 виконати пусту команду
print "x= %*.*f%s"%(5,2,51.2935,"mm") # форматування рядка
print "x= %4d %o %x"%(16,16,16) # форматування рядка
print "x= {0} {unit}".format('five', unit='mm') # форматування рядка
print "   hello  ".strip() # видалити пробіли на початку і в кінці
print "hello world!".find("ll",0,4) # знайти входження підрядка на проміжку
print "hello".replace("h","H",1) # замінити 1 раз "h" на "H"
lst="a,b,c".split(",") # розбити рядок на список (розділювач ",")
s1="" # пустий рядок
print s1.join(lst) # об'єднати список в рядок
print oct(16), hex(16) # вивести рядкове представлення вісімкового і шістнадцяткового числа
print ord('A'),chr(65),unichr(65),unicode('ABC','utf-8') # вивести код символу, символ за кодом, символ Unicode за кодом, об'єкт в заданому кодуванні
