# -*- coding: utf-8 -*-
"""
# Оператори break і continue
Інструкція `break` негайно завершує виконання циклу, а інструкція `continue` негайно переходить до наступної ітерації циклу.
"""
x=0 # присвоїти x 0
while x<=10: # поки x менше рівне 10
    y=x**2
    x+=1 # збільшити x
    if y>50: # якщо y>50
        break # перервати цикл
    elif 10<y<30: # якщо 10<y<30
        print "*", # вивести на екран "*"
        continue # перейти до наступної ітерації
    print y, # вивести на екран y
