# -*- coding: utf-8 -*-
"""
# Атрибути класу і атрибути екземпляра
Важливо розрізняти атрибути класу і атрибути об'єкта цього класу. Екземпляр успадковує значення атрибутів класу. Для перегляду атрибутів застосовуйте атрибут `__dict__`, який містить словник з атрибутами об'єкта, і функцію `dir`, яка повертає список атрибутів об'єкта.
"""
class A(): # клас A
    a=0 # атрибут класу
class B(A): # клас B
    b=0 # атрибут класу
A.a=1 # зміна значення атрибута класу
A.x=2 # створення нового атрибута класу та зміна його значення 
print A.__dict__ # {'a': 1, 'x': 2, '__module__': '__main__', '__doc__': None}
obj=A() # створити екземпляр класу A
print obj.a # 1
print obj.x # 2
A.a=3 # зміна значення атрибута класу
obj.a=4 # зміна значення атрибута екземпляра
print A.__dict__ # {'a': 3, 'x': 2, '__module__': '__main__', '__doc__': None}
print obj.__dict__ # {'a': 4}
print B.__dict__ # {'__module__': '__main__', 'b': 0, '__doc__': None}
print dir(B) # ['__doc__', '__module__', 'a', 'b', 'x']
print B.a # 3
B.a=5 # зміна значення атрибута класу
print B.a # 5
print A.a # 3
