# -*- coding: utf-8 -*-
"""
# scipy.fftpack дискретне перетворення Фур'є
Перетворення Фур'є — інтегральне перетворення однієї комплекснозначної функції дійсної змінної на іншу. Розкладає функцію на осциляторні функції, тобто подає сигнал у вигляді суми гармонічних коливань. Використовується для розрахунку спектра частот сигналів, які змінні у часі. Для дискретних функцій застосовують дискретне перетворення Фур'є. Модуль `scipy.fftpack` використовує швидкі алгоритми прямого і оберненого дискретного перетворення Фур'є (FFT).
"""
import numpy as np
from scipy.fftpack import fft
import matplotlib.pyplot as plt
N = 600 # кількість точок
T = 1.0 / 800.0 # проміжки часу
A1=1.0; A2=0.5 # амплітуди
f1=10.0; f2=100.0 # лінійні частоти
omega1=f1*2.0*np.pi; omega2=f2*2.0*np.pi # циклічні частоти
x = np.linspace(0.0, N*T, N) # час
y = A1*np.sin(omega1*x) + A2*np.sin(omega2*x) # сигнал (лінійна комбінація синусоїдальних сигналів)
plt.plot(x,y,'k') # нарисувати сигнал
plt.xlabel('t');plt.ylabel('y');plt.grid();plt.show()
print "Рисунок - Сигнал"

yf = fft(y) # розрахувати спектр частот для сигналів змінних у часі за допомогою дискретного перетворення Фур'є. Декомпозиція сигналу на частоти і амплітуди.
xf = np.linspace(0.0, 1.0/(2.0*T), N/2) # частоти
yf_=2.0/N * np.abs(yf[0:N/2]) # амплітуди
plt.figure()
plt.plot(xf, yf_,'k') # нарисувати спектр
plt.xlabel('f');plt.ylabel('A');plt.grid();plt.show()
print "Рисунок - Амплітудно-частотна характеристика сигналу"
