# -*- coding: utf-8 -*-
"""
# pdb -  відлагоджувач Python
pdb - інтерактивний відлагоджувач (debugger) вихідного коду Python-програм, який дозволяє установлення точок зупинки, виконання в покроковому режимі, обчислення довільних Python-виразів, перегляд кадрів стеку та поставарійне відлагодження. Виконайте програму так:

    python main.py
І введіть послідовно наступні команди відлагожувача:

    n (виконувати до наступного рядка)
    s (виконати рядок і зупинитись в функції, що викликається)
    a (вивести аргументи функції)
    p x (вивести значення x)
    !x (або так)
    !x=2 (змінити значення x)
    r (виконувати до виходу з функції)
    c (продовжити до точки зупинки)
Відлагоджувач можна також викликати командою:

    python -m pdb main.py
Щоб вийти з відлагоджувача введіть команду `q`. Для ознайомлення з поставарійним відлагодженням закоментуйте рядок `import pdb; pdb.set_trace()` і введіть в консолі команди:

    python
    >>> import main          # тут виникне ZeroDivisionError
    >>> import pdb; pdb.pm()
    x
    q
    >>> exit()
"""
def f(x):
    return 1.0/x
import pdb; pdb.set_trace() # точка зупинки (ввійти в відлагоджувач)
print f(1)
print f(0)