# -*- coding: utf-8 -*-
"""
# Числові типи даних
До числових типів даних належать: цілі, дійсний, булевий і комплексний. В Python застосовується динамічна типізація - тип змінної визначається під час операції присвоювання. Тип змінної можна дізнатись за допомогою функції `type`.
"""
a=16 # ціле десяткове int
b=020 # ціле вісімкове int
c=0x10 # ціле шістнадцяткове int
d=e=16L # довге ціле long
print a,b,c,d,e,type(e)
x=5.71 # дійсне float
y=-3.95e+3 # дійсне float
print x,y
i=True # булеве bool
print i
cn1=1+1j # комплексне complex
print cn1
