# -*- coding: utf-8 -*-
"""
# Ітератори
Ітератор - це об'єкт, який призначений для обходу елементів певного контейнера. Ітератори використовуються в інструкції `for`. Ітератор реалізує метод `next`, який повертає наступний елемент контейнера, або викликає виняткову ситуацію `StopIteration`, якщо елементів більше немає.
"""
it=iter([1,2,3]) # ітератор
for i in it: print i, # вивести 1 2 3
print
def f(l=[]): # функція
    l.append(1) # додати в список 1
    return l # повертає список
it=iter(f,[1,1,1]) # ітератор, який викликає f поки нею не буде повернуто [1,1,1]
for i in it: print i,
