# -*- coding: utf-8 -*-
"""
# Функції
Функція - це частина коду програми (підпрограма), до якого можна звернутись з інших місць програми. Визначити функцію можна за допомогою інструкції `def`. Функція може повертати певне значення за допомогою інструкції `return`. Атрибут `__doc__` містить документацію функції.
"""
def sum(a,b=0): # визначити функцію з параметрами a, b
    "Повертає суму двох чисел" # рядок документації
    c=a+b
    return c # функція повертає значення c
print sum(2,2), # вивести значення функції (a=2, b=2)
print sum(a=2,b=2), # або так
print sum(2) # вивести значення функції (a=2, b=0)
print sum.__doc__ # вивести документацію
