# -*- coding: utf-8 -*-
"""
# pymorphy2 - морфологічний аналізатор
pymorphy2 (https://github.com/kmike/pymorphy2) - морфологічний аналізатор для російської і української мови. Повертає граматичну інформацію про слово (число, рід, відмінок, частина мови і т.д.), приводить слово до нормальної форми, ставить слово в потрібну форму. Використовує словник opencorpora.org. Для незнайомих слів будуються гіпотези. Дивись також NLTK (www.nltk.org) - пакет для обробки природної мови. Ці пакети широко застосувуються в галузі штучного інтелекту.
"""
import pymorphy2
morph = pymorphy2.MorphAnalyzer() # об'єкт для морфологічного аналізу
pp=morph.parse(u'уменьшить') # виконати аналіз слова
p=pp[0] # перший варіант слова
t=p.tag # набір грамем слова
print t.POS # частина мови
#див. також t.tense (час), t.case (відмінок), t.gender (рід), t.number (число), t.mood (спосіб дієслова), t.стан (voice) та ін.
n=p.normalized # нормальна форма
print n.word 
print n.inflect({'VERB','3per','futr'}).word # перевести слово в іншу форму
for x in p.lexeme: # лексема (різні форми слова)
    print x.word,
"""
    INFN
    уменьшить
    уменьшит
    уменьшить уменьшил уменьшила уменьшило ...
"""
