# -*- coding: utf-8 -*-
"""
# win32com.client - об'єкти Excel
COM (Component Object Model) — платформа компонентно-орієнтованого програмування, яка використовується в ОС Windows. Підтримує повторене використання і можливість взаємодії об’єктів незалежно від мови програмування, на якій вони були розроблені. Основними елементами COM є: об’єкт COM (екземпляр класу COM в сервері COM), сервер COM (програма, яка організовує доступ до створеного в ній об’єкта COM, реалізуючи інтерфейси), клієнт COM (програма, яка, використовуючи інтерфейс, отримує доступ до об’єкта COM), інтерфейс COM (визначає відкриті методи, які використовуються для доступу до об’єкта COM), клас COM (реалізація інтерфейсу COM в сервері COM). Пакет `win32com` є частиною бібліотеки pywin32 і реалізує пітримку COM в Python. В прикладі створюється клієнт COM для доступу до об'єктів Excel.
"""
import win32com.client # імпортувати модуль win32com.client
obj = win32com.client.Dispatch("Excel.Application") # створити об'єкт Excel.Application
obj.Visible = 1 # зробити Excel видимим
obj.Workbooks.Add() # додати робочу книгу
obj.Cells(1,1).Value = "Hello" # в комірку 1,1 помістити "Hello"
"""
![](fig.png)

Рисунок - Результат роботи програми в Excel
"""
