# -*- coding: utf-8 -*-
"""
# Обробка виняткових ситуацій
Інструкції `try` і `except` дозволяють перехоплювати і обробляти виняткові ситуації - помилки, що виникають під час виконання програми. Якщо помилка виникає в блоці `try`, то керування передається тому блоку `except`, який відповідає типу помилки.
"""
import sys # імпорт модуля sys
for x in -1, 0, "0.2", 1e1000: # повторити наступні команди для різних значень змінної x
    try: # перехоплювати помилки виконання
        assert x>=0 # якщо x менше 0, генерувати AssertionError
        y=int(x) # помилка ValueError
        z=1/x # помилка ZeroDivisionError
    except ZeroDivisionError: # якщо ділення на нуль
        print x,"Помилка! Ділення на нуль"
    except: # якщо інші помилки
        print x,sys.exc_type # вивести тип помилки
