# -*- coding: utf-8 -*-
"""
# scipy.optimize.fsolve - розв'язування рівнянь
Для розв'язування нелінійного рівняння чисельним методом застосовують функцію `scipy.optimize.fsolve`. Для розв'язування систем нелінійних рівнянь див. `scipy.optimize.root`. В прикладі розв'язується рівняння $x^{2}-2=0$.
"""
import numpy as np
from scipy.optimize import fsolve
def f(x,a): # функція (x - вектор, a - константа)
    return x**2-a # повертає ліву частину рівняння
x0 = fsolve(f, np.array([-10,10]), args=(2,)) # розв'язати рівняння з початковими значеннями коренів x0=[-10,10]
print x0 # корені рівняння
