# -*- coding: utf-8 -*-
"""
# numpy.random - генератори випадкових чисел
Модуль `numpy.random` містить функції для генерації випадкових чисел з різними розподілами ймовірностей.
"""
import numpy as np
print np.random.random(3) # випадкова вибірка з інтервалу [0.0, 1.0) рівноімовірного розподілу
X=np.random.uniform(10,20,1000) # випадкова вибірка з рівноімовірного розподілу (ліва границя 10, права границя 20)
print X.mean(), X.std(), X.var() # середнє, середньоквадратичне відхилення, дисперсія
#або np.mean(X), np.std(X), np.var(X)
X=np.random.triangular(10,15,20,1000) # випадкова вибірка з трикутного розподілу (ліва границя 10, середнє 15, права границя 20)
print X.mean(), X.std(), X.var()
X=np.random.normal(15,1,1000) # випадкова вибірка з нормального розподілу (середнє 15, середньоквадратичне відхилення 1)
print X.mean(), X.std(), X.var()
