# -*- coding: utf-8 -*-
"""
# scipy.optimize.fminbound - локальна оптимізація невідомої функції
В цьому прикладі *f(x)* не розраховує значення наперед відомої функції і для кожного значення *x* користувач повинен ввести відповідне значення *y*, отримане, наприклад, експериментом. Для прикладу $y=x^2$, тоді на запит *x=2* користувач повинен ввести *y=4*. Користувач вводить *y* поки різниця нового і попереднього *x* є великою.
"""
import numpy as np
from scipy.optimize import fminbound
i=0 # лічильник ітерацій
def f(x):
    global i # глобальна змінна
    i+=1 # збільшити лічильник
    y=input("Iteration %d x=%f y="%(i,x)) # вивести `x` і ввести відповідне `y`
    return y
argmin = fminbound(f, -1, 1) # знайти мінімум
print argmin
