# -*- coding: utf-8 -*-
"""
# Співпрограми
Співпрогама - це функція генератора, яка містить вираз `(yield)`. Метод `send` об'єкта співпрограми передає їй дані, які повертаються виразом `(yield)`.
"""
def coroutine(): # співпрограма обробляє послідовність вхідних даних
    while True:
        x=(yield) # отримати дані через send()
        yield 2*x # генерувати значення 2*x
corObj=coroutine() # створити об'єкт генератора
for x in [1,2,3]: # виведе: 2 4 6
    corObj.next() # переміститись до першої інструкції (yield)
    print corObj.send(x), # передати дані співпрограмі через вираз (yield), отримати значення після другої інструкції yield
corObj.close() # завершити роботу з corObj
