# -*- coding: utf-8 -*-
"""
# pickle - серіалізація об'єктів Python
Серіалізація - це процес перетворення якої-небудь структури даних в послідовність бітів. Часто використовується для передачі об'єктів по мережі або для збереження їх у файли. Модуль pickle реалізує алгоритми для серіалізації і десеріалізації об'єктів Python. 
"""
import pickle
with open('data.pkl', 'wb') as f: # відкрити бінарний файл для запису
    pickle.dump([1,2,3], f) # серіалізувати список у файл
    pickle.dump([4,5,6], f)
with open('data.pkl', 'rb') as f: # відкрити бінарний файл для читання
    print pickle.load(f) # десеріалізувати список
    print pickle.load(f)
s=pickle.dumps([7,8,9]) # серіалізувати список в рядок 
print pickle.loads(s) # десеріалізувати список
