# -*- coding: utf-8 -*-
"""
# Словник. Оператори для словників
Словник (dict) - це асоціативний масив, який містить сукупність пар (ключ, значення). Значеннями можуть бути об'єкти будь-якого типу, а ключами - об'єкти, які не змінюються (числа, рядки, кортежі).
"""
d1={1:"Іванов",2:"Петров",3:"Коваль"} # словник
d2=dict([("Іванов",1982),("Петров",1980),("Коваль",1978)]) # словник
d3=dict(x=1.5,y=5.2,z=3.0) # словник
d2["Іванов"]=1983 # зміна значення за ключем "Іванов"
del d2["Іванов"] # видалити елемент за ключем
print "Петров" in d2 # чи є ключ "Петров" у словнику d2
for k,v in d2.iteritems():print k,v, # цикл за елементами
print
for k in d2.iterkeys():pass # цикл за ключами
for v in d2.itervalues():pass # цикл за значеннями
l3=d2.items() # список з елементів-пар (ключ,значення)
l1=d2.keys() # список з ключів
l2=d2.values() # список зі значень
print d2.get("Петров",0) # значення за ключем, якщо немає - 0
d4=d1.fromkeys([1,2,3],"Male") # новий словник з ключів d1
print d4 # вивести словник
