# -*- coding: utf-8 -*-
"""
# scipy.integrate.odeint - модель коливань, що згасають
Модель коливань пружини з масою *m*, жорсткістю *j* та коефіцієнтом демпфування *с* описується диференціальним рівнянням другого порядку 

$m\frac{d^2y}{dt^2}+c\frac{dy}{dt}+jy=0$.

Спочатку його необхідно перетворити в систему диференціальних рівнянь першого порядку

$$\frac{dy}{dt}=y',$$
$$\frac{dy'}{dt}=\frac{-jy-cy'}{m};$$

де *y* - переміщення, *y'* - швидкість,  *dy'/dt* - прискорення. Початкові умови: y=1, y'=0. Знайти функції *y* та *y'*.
"""
from scipy.integrate import odeint
import numpy as np
import matplotlib.pyplot as plt

def deriv(y,t):
    m=1.0; j=1.0; c=0.1
    return [y[1], (-j*y[0]-c*y[1])/m] # повертає значення функцій dy/dt та dy'/dt
t = np.linspace(0.0, 10.0, 100) # час
yinit = np.array([1.0, 0.0]) # початкові умови для `y` та `y'`
y = odeint(deriv, yinit, t) # інтегруємо систему диф. рівнянь, повертає двовимірний масив зі значеннями `y` та `y'`
plt.plot(t, y[:,0], 'k-', t, y[:,1], 'k--') # переміщення і швидкість
plt.xlabel("t");plt.ylabel("y, y'");plt.grid();plt.show()
"""
Рисунок - Функції переміщення y (-) і швидкості y' (--)
"""
