# -*- coding: utf-8 -*-
"""
# Замикання
Замикання (closure) — це функція, яка визначена в тілі іншої функції і в якій є посилання на змінні, що оголошені зовні.
"""
a=0 # глобальна змінна
def func(b): # функція
    def fn(c): # внутрішня функція (замикання)
        global a # звертання до глобальної змінної
        a=1 # зміна значення глобальної змінної
        print a,b,c # вивести a,b,c
    print 'func'
    return fn # повернути функцію
f=func(2) # аргумент b=2, виведе: 'func'
f(3) # аргумент c=3, виведе: 1 2 3
print a # 1 - значення глобальної змінної змінилось
